posts/asking_smart_questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Asking Smart Questions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/stylesheet.css"/>
</head>
<body>
<div id="preamble" class="status">
<a class="alignleft" href="/">/home/otg</a>
                                        <a class="alignright" href="/about.html">[about]</a>
                                        <a class="alignright" href="/rss.xml">[rss]</a>
</div>
<div id="content" class="content">
<h1 class="title">Asking Smart Questions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#what-this-isnt">What this isn't</a></li>
<li><a href="#motivation">Motivation</a></li>
<li><a href="#things-to-do-before-asking">Things to do before asking</a></li>
<li><a href="#things-to-include-in-your-question">Things to include in your question</a></li>
<li><a href="#what-not-to-do">What <b><i>not</i></b> to do</a></li>
<li><a href="#possible-answers-to-bad-questions">Possible answers to bad questions</a></li>
<li><a href="#what-to-do-once-you-have-an-answer">What to do once you have an answer</a></li>
</ul>
</div>
</div>
<p>
This post aims to be a TLDR of the popular page <a href="http://catb.org/~esr/faqs/smart-questions.html">How to Ask Questions the Smart
Way</a>. It's also a pet peeve of mine when someone asks a lazy question, so I want
to quickly address some things to avoid when asking questions.
</p>

<p>
This post is also primarily about asking questions on instant messaging servers
or channels, similar to IRC (or Discord for most of the younger crowd).
</p>

<p>
Also note that this is about technical questions and may not make sense in every
context. If you <i>can</i> ask a question the smart way, you probably should.
</p>

<div id="outline-container-what-this-isnt" class="outline-2">
<h2 id="what-this-isnt">What this isn't</h2>
<div class="outline-text-2" id="text-what-this-isnt">
<p>
If you're casually reading this, you might make the mistake of thinking this all
sounds like "the best way to ask questions is to not ask questions at all." This
is not what this means at all.
</p>

<p>
Asking good questions is incredibly important, both in developing your own
understanding of a concept, and in developing that of others. If you ask a good
question and one someone is able to answer it, most likely <b>you're not the only
one learning from it</b>.
</p>

<p>
Asking a good question feels a lot better than asking a bad question, and
answering a good question feels amazing. Answering a bad question, on the other
hand, feels like a waste of time, so people eventually stop doing it and start
avoiding you.
</p>

<p>
Also note that a bad question is <i>not</i> a question which "most people already
know the answer to". In this context, a bad question is simply a lazy question,
one which you have made little to no effort of answering by yourself.
</p>
</div>
</div>

<div id="outline-container-motivation" class="outline-2">
<h2 id="motivation">Motivation</h2>
<div class="outline-text-2" id="text-motivation">
<p>
To get a good answer to a problem, you need to be able to develop your questions
suitably. Asking a good question is a difficult process, whereas asking a poor
question will only display laziness and make people less likely to help you.
Learning to ask questions the smart way may also help you to answer them
yourself, or help others get their questions answered.
</p>
</div>
</div>

<div id="outline-container-things-to-do-before-asking" class="outline-2">
<h2 id="things-to-do-before-asking">Things to do before asking</h2>
<div class="outline-text-2" id="text-things-to-do-before-asking">
<ol class="org-ol">
<li>Ask yourself, is this the right question?</li>
<li>Read the man page</li>
<li>Search the internet</li>
<li>Try what you find</li>
</ol>

<p>
Often, the question you're asking is already answered elsewhere, or even
documented. If you don't look for an answer to your own question before asking
someone else, you're just being lazy, and the people you're asking will tell you
that.
</p>

<p>
RTFM (read the f####ng manual) and STFW (search the f####ng web, sometimes
written "google is your friend") are not insults. They're instructions, and
often will lead to you finding your answer.
</p>

<p>
If you are unsure where to start, make <i>that</i> your question. Maybe someone will
kindly guide you through starting, before setting you off on your own.
</p>

<p>
If through this process you have found an answer, try it! See if it works! This
should be obvious, but apparently not to everyone.
</p>

<p>
There is also the case to consider, does the question you want to ask make
sense? Avoid "X Y problems", don't get stuck on a particular style of solution
to a problem that is best solved another way. If you absolutely <i>must</i> use a
particular method, make sure to justify that when asking the question.
</p>

<p>
In short, before giving other people your problem, try to solve it yourself. If
you can't do that, <i>then</i> ask, making sure to say what you have tried.
</p>
</div>
</div>

<div id="outline-container-things-to-include-in-your-question" class="outline-2">
<h2 id="things-to-include-in-your-question">Things to include in your question</h2>
<div class="outline-text-2" id="text-things-to-include-in-your-question">
<p>
Regardless of what your question is about, you should send <i>what you have
tried</i>, and if it failed then also post <i>how</i> or <i>why</i> it failed. Making sure to
include this in your question should also remind you to try solving your own
problem before giving it to other people. If you don't include what you have
already tried, people are likely to send you things you have already done,
wasting more of both theirs and your own time.
</p>

<p>
If you want someone to help you with your code, post the error, the code and
what you want it to do.
</p>

<p>
If you want help understanding a concept, post what your current understanding
of it, so people who understand it better are able to see what you need help
with specifically.
</p>

<p>
If you want help finding a piece of software or algorithm to suit your needs,
post the context and the desired goal. Post what you have found or considered
and why it is not enough. In the case of the piece of software, perhaps one of
the solutions you found is enough and you only have to configure it a bit,
though what you need to change specifically might be hiding somewhere in the
documentation.
</p>
</div>
</div>

<div id="outline-container-what-not-to-do" class="outline-2">
<h2 id="what-not-to-do">What <b><i>not</i></b> to do</h2>
<div class="outline-text-2" id="text-what-not-to-do">
<p>
Most of these should be obvious. Unfortunately, to some people they apparently
aren't.
</p>

<p>
Firstly, make sure that you're asking in the right place. If you ask for help
writing C in a channel for OCaml, either everyone will ignore you or someone
will tell you go to the appropriate channel.
</p>

<p>
Regardless of whether your question is smart or not, <i>don't <a href="https://dontasktoask.com/">ask to ask</a></i>. Just
ask your question, or people (should) ignore you. No one wants to lock
themselves into helping you, just because you didn't send the details. If, by
some miracle, someone <i>does</i> want to help you, by not having posted any details
about your question you waste their time, as they now have to ask you for
details.
</p>

<p>
Don't open direct/private messages with people to ask for help, unless agreed
with them beforehand that you can do so. Post in the public channel, where
everyone can see what you need help with and anyone can help you.
</p>

<p>
Don't ask the same question in multiple channels. Someone may answer your
question in one of them, then someone else might answer the same question in the
other channel. Managing answers in different channels is a hassle for you, and
it's a waste of time for the second person.
</p>
</div>
</div>

<div id="outline-container-possible-answers-to-bad-questions" class="outline-2">
<h2 id="possible-answers-to-bad-questions">Possible answers to bad questions</h2>
<div class="outline-text-2" id="text-possible-answers-to-bad-questions">
<p>
If you're sent a link to <a href="https://dontasktoask.com/">https://dontasktoask.com/</a> you probably just asked a bad
question. Don't let that put you off, put more detail into your question and
don't make the same mistake in future.
</p>

<p>
If you're told to RTFM or STFW, don't take this as an insult. Someone has just
told you that the answer to your question already exits. If you have already
done both of these and still can't find it, explain what you have looked at and
they should guide you to the correct place. In future, send more details with
the original question.
</p>

<p>
If you're told to go to a different channel, you should probably go to that
channel. If you still believe that you shouldn't be asking elsewhere, explain
so, but don't start any arguments.
</p>

<p>
If you're told not to send the same question in multiple channels, or to get out
of DMs and ask in the public channel, then that's really just on you. Apologise
and move on.
</p>
</div>
</div>

<div id="outline-container-what-to-do-once-you-have-an-answer" class="outline-2">
<h2 id="what-to-do-once-you-have-an-answer">What to do once you have an answer</h2>
<div class="outline-text-2" id="text-what-to-do-once-you-have-an-answer">
<p>
This is really only if you feel benevolent, but it can help other people a lot.
If you feel that other people would benefit from knowing about your problem and
the solution you made for it, put that online for other people to find. Some
ways you could do that are:
</p>

<ul class="org-ul">
<li>You could write a public <a href="https://gist.github.com/">gist</a>, explaining what it's for.</li>
<li>You could write a blog post, detailing the problem and the solution.</li>
<li>You could make a question on some forum, like StackOverflow, and
answer it yourself (or send the question link to the person who helped you).</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Unless otherwise noted, the content of this site is licensed under
                                         <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">CC BY-NC-SA 4.0</a>
</div>
</body>
</html>
